design_model/src/main/resources/行为型模式/迭代器模式/迭代器模式.md
```mermaid
classDiagram
    class Iterator {
        <<抽象迭代器>>
        +abstract first();
        +abstract next();
        +abstract hasNext();
        +abstract currentItem();
    }
    class ConcreteIterator {
        <<具体迭代器>>
        +first();
        +next();
        +hasNext();
        +currentItem();
    }
    class Aggregate {
        <<抽象聚合类>>
        +abstract createIterator();
    }
    class ConcreteAggregate {
        <<具体聚合类>>
        +createIterator();
    }
    ConcreteIterator --|> Iterator
    ConcreteAggregate --|> Aggregate
    ConcreteAggregate ..> ConcreteIterator
    ConcreteIterator --> ConcreteAggregate
```
